{
    "url": "https://microsoft.github.io/autogen/blog/2024/01/23/Code-execution-in-docker",
    "title": "Code execution is now by default inside docker container",
    "sections": [
        {
            "title": "TL;DR\n​",
            "content": [
                {
                    "text": "AutoGen 0.2.8 enhances operational safety by making 'code execution inside a Docker container' the default setting, focusing on informing users about its operations and empowering them to make informed decisions regarding code execution.\n\nThe new release introduces a breaking change where the\nuse_docker\nargument is set to\nTrue\nby default in code executing agents. This change underscores our commitment to prioritizing security and safety in AutoGen."
                }
            ],
            "subsections": []
        },
        {
            "title": "Introduction\n​",
            "content": [
                {
                    "text": "AutoGen has code-executing agents, usually defined as a\nUserProxyAgent\n, where code execution is by default ON. Until now, unless explicitly specified by the user, any code generated by other agents would be executed by code-execution agents locally, i.e. wherever AutoGen was being executed. If AutoGen happened to be run in a docker container then the risks of running code were minimized. However, if AutoGen runs outside of Docker, it's easy particularly for new users to overlook code-execution risks.\n\nAutoGen has now changed to by default execute any code inside a docker container (unless execution is already happening inside a docker container). It will launch a Docker image (either user-provided or default), execute the new code, and then terminate the image, preparing for the next code execution cycle.\n\nWe understand that not everyone is concerned about this especially when playing around with AutoGen for the first time. We have provided easy ways to turn this requirement off. But we believe that making sure that the user is aware of the fact that code will be executed locally, and prompting them to think about the security implications of running code locally is the right step for AutoGen."
                }
            ],
            "subsections": []
        },
        {
            "title": "Example\n​",
            "content": [
                {
                    "text": "The example shows the default behaviour which is that any code generated by assistant agent and executed by user_proxy agent, will attempt to use a docker container to execute the code. If docker is not running, it will throw an error. User can decide to activate docker or opt in for local code execution."
                },
                {
                    "code": {
                        "language": "python",
                        "script": "from\nautogen\nimport\nAssistantAgent\n,\nUserProxyAgent\n,\nconfig_list_from_json\nassistant\n=\nAssistantAgent\n(\n\"assistant\"\n,\nllm_config\n=\n{\n\"config_list\"\n:\nconfig_list\n}\n)\nuser_proxy\n=\nUserProxyAgent\n(\n\"user_proxy\"\n,\ncode_execution_config\n=\n{\n\"work_dir\"\n:\n\"coding\"\n}\n)\nuser_proxy\n.\ninitiate_chat\n(\nassistant\n,\nmessage\n=\n\"Plot a chart of NVDA and TESLA stock price change YTD.\"\n)"
                    }
                },
                {
                    "text": "To opt out of from this default behaviour there are some options."
                }
            ],
            "subsections": [
                {
                    "title": "Diasable code execution entirely\n​",
                    "content": [
                        {
                            "code": {
                                "language": "python",
                                "script": "user_proxy\n=\nautogen\n.\nUserProxyAgent\n(\nname\n=\n\"user_proxy\"\n,\nllm_config\n=\nllm_config\n,\ncode_execution_config\n=\nFalse\n)"
                            }
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "title": "Related documentation\n​",
            "content": [],
            "subsections": []
        },
        {
            "title": "Conclusion\n​",
            "content": [
                {
                    "text": "AutoGen 0.2.8 now improves the code execution safety and is ensuring that the user is properly informed of what autogen is doing and can make decisions around code-execution."
                }
            ],
            "subsections": []
        }
    ],
    "images": []
}